{
    "global_title": "TFC Smithing Calculator",
    "language_title": "Language <span class='globe'>🌐</span>",
    "tutorial": {
        "tutorial_btn": "How to Use",
        "title": "How to Use",
        "forge_section": {
            "title": "Forging Process 🔨",
            "start_forging": "Before starting the forging process, you must align the two indicators shown in the red circles.\nRegardless of the selected sequence, forging will fail if these points are not aligned.",
            "alligned_points": "Once the two indicators are perfectly aligned, you can follow the calculated sequence step by step.\nThe system determines the optimal order of actions required to forge the item successfully.",
            "output": "Select the exact same actions as shown in the game, align the points, and apply the sequence \ngenerated by this system. If followed correctly, the forging process will succeed."
        },
        "alloy_section": {
            "title": "Alloy Calculator 🔥",
            "ores_description": "The Alloy Calculator helps you determine the total number of ingots produced and the metal composition \nbased on the ingots you use in the melting process.",
            "important": "<strong>Important:</strong> This tool calculates <u>ingots</u>, not the raw ore pieces that you mine in the game.",
            "chunks_description": "When mining ores like Malachite (for copper), you obtain ore chunks, which can be Poor, Normal, or Rich quality.\nEach piece provides different amounts of molten metal. The melting process requires gathering enough metal from \nthese pieces to form full ingots.",
            "footer": "Use this calculator to determine the final ingot composition once you have the required number of ingots."
        }
    },
    "forge_section": {
        "title": "Forging Process 🔨",
        "calculate_sequence_btn": "Calculate Sequence",
        "error_message": "You must select at least two actions to calculate the forging sequence!"
    },
    "alloy_section": {
        "title": "Alloy Calculator 🔥",
        "input_title": "Metal Alloy Composition",
        "input_description": "Enter the number of ingots used for each metal to calculate the alloy composition.",
        "ingot_1": "Ingot 1:",
        "ingot_2": "Ingot 2:",
        "ingot_3": "Ingot 3:",
        "ingot_4": "Ingot 4:",
        "calculate_alloy_btn": "Calculate Alloy",
        "error_message": "Please enter at least two different ingot values to create an alloy.",
        "result_total": "<strong>Total Ingots:</strong> <span id='totalIngots'>0</span>",
        "result_composition": "<strong>Composition:</strong> <span id='alloyComposition'>-</span>"
    }
}